PX4/PX4-Autopilot/platforms/nuttx/src/px4/stm/stm32_common/dshot/dshot.c
	// Disable capture DMA
	io_timer_capture_dma_req(timer_index, capture_channel, false);

	// Stop DMA (should already be finished)
	stm32_dmastop(timer_configs[timer_index].dma_handle);

	// Re-initialize all output channels on this timer
	for (uint8_t output_channel = 0; output_channel < MAX_TIMER_IO_CHANNELS; output_channel++) {

		bool is_this_timer = timer_index == timer_io_channels[output_channel].timer_index;
		uint8_t timer_channel_index = timer_io_channels[output_channel].timer_channel - 1;
		bool channel_initialized = timer_configs[timer_index].initialized_channels[timer_channel_index];

		if (is_this_timer && channel_initialized) {
			io_timer_unallocate_channel(output_channel);
			// Initialize back to DShotInverted to bring IO back to the expected idle state
			io_timer_channel_init(output_channel, IOTimerChanMode_DshotInverted, NULL, NULL);
		}
	}

	// Invalidate the dcache to ensure most recent data is available
	up_invalidate_dcache((uintptr_t) dshot_capture_buffer,
			     (uintptr_t) dshot_capture_buffer + DSHOT_CAPTURE_BUFFER_SIZE(MAX_NUM_CHANNELS_PER_TIMER));

	// Process eRPM frames from all channels on this timer
	process_capture_results(timer_index, capture_channel);

	// Enable all channels configured as DShotInverted
	io_timer_set_enable(true, IOTimerChanMode_DshotInverted, IO_TIMER_ALL_MODES_CHANNELS);

	perf_end(hrt_callback_perf);

	_bdshot_cycle_complete = true;
}

void process_capture_results(uint8_t timer_index, uint8_t channel_index)
{
	(void)timer_index; // NOTE: in the current implementation only 1 timer is used
	uint8_t output_channel = output_channel_from_timer_channel(timer_index, channel_index);
	uint32_t value = convert_edge_intervals_to_bitstream(channel_index);

	// Decode RLL
	value = (value ^ (value >> 1));

	// Decode GCR
	uint32_t payload = gcr_decode[value & 0x1f];
	payload |= gcr_decode[(value >> 5) & 0x1f] << 4;
	payload |= gcr_decode[(value >> 10) & 0x1f] << 8;
	payload |= gcr_decode[(value >> 15) & 0x1f] << 12;

	// Calculate checksum
	uint32_t checksum = payload;
	checksum = checksum ^ (checksum >> 8);
	checksum = checksum ^ (checksum >> NIBBLES_SIZE);

	if ((checksum & 0xF) != 0xF) {
		++read_fail_crc[output_channel];
		if (_consecutive_failures[output_channel]++ > BDSHOT_OFFLINE_COUNT) {
			_consecutive_failures[output_channel] = BDSHOT_OFFLINE_COUNT;
			_consecutive_successes[output_channel] = 0;
			_online[output_channel] = false;
		}

		_bdshot_processed[output_channel] = true;
		return;
	}

	++read_ok[output_channel];
	if (_consecutive_successes[output_channel]++ > BDSHOT_OFFLINE_COUNT) {
		_consecutive_successes[output_channel] = BDSHOT_OFFLINE_COUNT;
		_consecutive_failures[output_channel] = 0;
		_online[output_channel] = true;
	}

	// Convert payload into telem type/value
	struct BDShotTelemetry packet = {};
	payload = (payload >> 4) & 0xFFF;
	decode_dshot_telemetry(payload, &packet);

	switch (packet.type) {
	case DSHOT_EDT_ERPM:
		_erpms[output_channel] = packet.value;
		break;
	case DSHOT_EDT_TEMPERATURE:
		_temperatures[output_channel] = packet.value;
		_temperatures_ready[output_channel] = true;
		break;
	case DSHOT_EDT_VOLTAGE:
		_voltages[output_channel] = packet.value;
		_voltages_ready[output_channel] = true;
		break;
	case DSHOT_EDT_CURRENT:
		_currents[output_channel] = packet.value;
		_currents_ready[output_channel] = true;
		break;
	case DSHOT_EDT_STATE_EVENT:
		// TODO: Handle these?
		break;
	default:
		PX4_WARN("unknown EDT type %d", packet.type);
		break;
	}

	_bdshot_processed[output_channel] = true;
}

// Converts captured edge timestamps into a raw bit stream.
// Measures the time intervals between signal edges to determine how many consecutive
// 1s or 0s to shift in, alternating the bit value with each edge transition.
// Returns a 20 bit raw value that still needs RLL and GCR decoding.
uint32_t convert_edge_intervals_to_bitstream(uint8_t channel_index)
{
	uint32_t value = 0;
	uint32_t high = 1; // We start off with high
	unsigned shifted = 0;

	// We can ignore the very first data point as it's the pulse before it starts.
	unsigned previous = dshot_capture_buffer[channel_index][1];

	// Loop through the capture buffer for the specified channel
	for (unsigned i = 2; i < CHANNEL_CAPTURE_BUFF_SIZE; ++i) {

		if (dshot_capture_buffer[channel_index][i] == 0) {
			// Once we get zeros we're through
			break;
		}

		// This seemss to work with dshot 150, 300, 600, 1200
		// The values were found by trial and error to get the quantization just right.
		const uint32_t bits = (dshot_capture_buffer[channel_index][i] - previous + 5) / 20;

		// Convert GCR encoded pulse train into value
		for (unsigned bit = 0; bit < bits; ++bit) {
			value = (value << 1) | high;
			++shifted;
		}

		// The next edge toggles.
		high = !high;

		previous = dshot_capture_buffer[channel_index][i];
	}

	if (shifted == 0) {
		// no data yet, or this time
		return 0;
	}

	// We need to make sure we shifted 21 times. We might have missed some low "pulses" at the very end.
	value <<= (21 - shifted);

	return value;
}

void decode_dshot_telemetry(uint32_t payload, struct BDShotTelemetry *packet)
{
	// Extended DShot Telemetry
	bool edt_enabled = _extended_dshot_telem;
	uint32_t mantissa = payload & 0x01FF;
	bool is_telemetry = (mantissa & 0x0100) == 0; // if the msb of the mantissa is zero, then this is an extended telemetry packet

	if (edt_enabled && is_telemetry) {
		packet->type = (payload & 0x0F00) >> 8;
		packet->value = payload & 0x00FF; // extended telemetry value is 8 bits wide

	} else {
		// otherwise it's an eRPM frame
		uint8_t exponent = ((payload >> 9) & 0x7); // 3 bit: exponent
		uint16_t period = (payload & 0x1FF); // 9 bit: period base
		period = period << exponent; // Period in usec

		packet->type = DSHOT_EDT_ERPM;

		if (period == 65408) {
			// Special case for zero motion (e.g., stationary motor)
			packet->value = 0;
		} else {
			packet->value = (1000000 * 60 / 100 + period / 2) / period;
		}
	}
}

// bits  1-11    - throttle value (0-47 are reserved for commands, 48-2047 give 2000 steps of throttle resolution)
// bit   12      - dshot telemetry enable/disable
// bits  13-16   - XOR checksum
void dshot_motor_data_set(unsigned channel, uint16_t data, bool telemetry)
{
	uint8_t timer_index = timer_io_channels[channel].timer_index;
	uint8_t timer_channel_index = timer_io_channels[channel].timer_channel - 1;
	bool channel_initialized = timer_configs[timer_index].initialized_channels[timer_channel_index];

	if (!channel_initialized) {
		return;
	}

	uint16_t packet = 0;
	uint16_t checksum = 0;

